namespace NureOpenDayBot.Constants
{
    public static class FacultiesConstants
    {
        public static readonly IReadOnlyCollection<string> Faculties = new HashSet<string>()
        {
            "КН", "КІУ", "АКТ", "ІТМ", "ІК", "ЕЛБІ", "ІРТЗІ"
        };

        public static readonly IReadOnlyDictionary<string, string> FacultyFullNames = new Dictionary<string, string>()
        {
            {"КН", "ФАКУЛЬТЕТ КОМП’ЮТЕРНИХ НАУК"},
            {"КІУ", "ФАКУЛЬТЕТ КОМП’ЮТЕРНОЇ ІНЖЕНЕРІЇ ТА УПРАВЛІННЯ"},
            {"АКТ", "ФАКУЛЬТЕТ АВТОМАТИКИ І КОМП’ЮТЕРИЗОВАНИХ ТЕХНОЛОГІЙ"},
            {"ІТМ", "ФАКУЛЬТЕТ ІНФОРМАЦІЙНО-АНАЛІТИЧНИХ ТЕХНОЛОГІЙ ТА МЕНЕДЖМЕНТУ"},
            {"ІК", "ФАКУЛЬТЕТ ІНФОКОМУНІКАЦІЙ"},
            {"ЕЛБІ", "ФАКУЛЬТЕТ ЕЛЕКТРОННОЇ ТА БІОМЕДИЧНОЇ ІНЖЕНЕРІЇ"},
            {"ІРТЗІ", "ФАКУЛЬТЕТ ІНФОРМАЦІЙНИХ РАДІОТЕХНОЛОГІЙ ТА ТЕХНІЧНОГО ЗАХИСТУ ІНФОРМАЦІЇ"},
        };

        public static readonly IReadOnlyDictionary<string, string> FacultyOpenDayInfo = new Dictionary<string, string>()
        {
            { "КН", "🕐 Захід відбудеться 25 травня 2023 року о 13:00\n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 16:00.\n\n🏢 Місто зустрічі: головний корпус ХНУРЕ" },

            { "КІУ", "🕐 Захід відбудеться 26 травня 2023 року о 14:00 \n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 17:00.\n\n🏢 Місто зустрічі: біля головного входу ХНУРЕ" },

            { "АКТ", "🕐 Захід відбудеться 27 травня 2023 року о 13:00 \n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 16:00.\n\n🏢 Місто зустрічі: актовий зал на другому поверсі" },

            { "ІТМ", "🕐 Захід відбудеться 28 травня 2023 року о 14:00 \n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 17:00.\n\n🏢 Місто зустрічі: головний корпус ХНУРЕ" },

            { "ІК", "🕐 Захід відбудеться 29 травня 2023 року о 13:00 \n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 16:00.\n\n🏢 Місто зустрічі: актовий зал на другому поверсі" },

            { "ЕЛБІ", "🕐 Захід відбудеться 30 травня 2023 року о 14:00 \n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 17:00.\n\n🏢 Місто зустрічі: біля головного входу ХНУРЕ" },

            { "ІРТЗІ", "🕐 Захід відбудеться 31 травня 2023 року о 13:00 \n\nℹ️ Під час заходу абітурієнти матимуть змогу дізнатись докладніше про" +
                " університет радіоелектроніки, поставити питання Приймальній комісії про особливості вступу," +
                " взяти участь у квесті для абітурієнтів, який розпочнеться о 16:00.\n\n🏢 Місто зустрічі: головний корпус ХНУРЕ" }
        };
    }
}
